import json

import pytest

from src.services import analyze_cashback


@pytest.mark.parametrize(
    "transactions, year, month, expected_output",
    (
        (
            [
                {
                    "Дата операции": "15.05.2023 12:34:56",
                    "Категория": "Продукты",
                    "Сумма операции": -1000,
                    "Кэшбэк": 10,
                },
                {
                    "Дата операции": "15.05.2023 12:34:56",
                    "Категория": "Продукты",
                    "Сумма операции": -2000,
                    "Кэшбэк": None,
                },
                {
                    "Дата операции": "15.05.2023 12:34:56",
                    "Категория": "Развлечения",
                    "Сумма операции": -500,
                    "Кэшбэк": 5,
                },
                {
                    "Дата операции": "15.04.2023 12:34:56",
                    "Категория": "Продукты",
                    "Сумма операции": -1000,
                    "Кэшбэк": 10,
                },
            ],
            2023,
            5,
            json.dumps({"Продукты": 30.0, "Развлечения": 5.0}, ensure_ascii=False, indent=4),
        ),
        (
            [
                {
                    "Дата операции": "15.06.2023 12:34:56",
                    "Категория": "Продукты",
                    "Сумма операции": -1000,
                    "Кэшбэк": None,
                },
                {
                    "Дата операции": "15.06.2023 12:34:56",
                    "Категория": "Продукты",
                    "Сумма операции": -2000,
                    "Кэшбэк": 20,
                },
                {
                    "Дата операции": "15.06.2023 12:34:56",
                    "Категория": "Развлечения",
                    "Сумма операции": -500,
                    "Кэшбэк": 5,
                },
                {
                    "Дата операции": "15.04.2023 12:34:56",
                    "Категория": "Продукты",
                    "Сумма операции": -1000,
                    "Кэшбэк": 10,
                },
            ],
            2023,
            6,
            json.dumps({"Продукты": 30.0, "Развлечения": 5.0}, ensure_ascii=False, indent=4),
        ),
        (
            [
                {
                    "Дата операции": "15.07.2023 12:34:56",
                    "Категория": "Транспорт",
                    "Сумма операции": -1500,
                    "Кэшбэк": 15,
                },
                {
                    "Дата операции": "15.07.2023 12:34:56",
                    "Категория": "Транспорт",
                    "Сумма операции": -500,
                    "Кэшбэк": None,
                },
                {
                    "Дата операции": "15.07.2023 12:34:56",
                    "Категория": "Развлечения",
                    "Сумма операции": -500,
                    "Кэшбэк": 5,
                },
                {
                    "Дата операции": "15.04.2023 12:34:56",
                    "Категория": "Транспорт",
                    "Сумма операции": -1000,
                    "Кэшбэк": 10,
                },
            ],
            2023,
            7,
            json.dumps({"Транспорт": 20.0, "Развлечения": 5.0}, ensure_ascii=False, indent=4),
        ),
    ),
)
# ауа
def test_analyze_cashback(transactions, year, month, expected_output):
    result = analyze_cashback(transactions, year, month)
    assert result == expected_output
